apple-open-source/macos/IOUSBMassStorageClass/UMCLogger/UMCLogger.cpp
    // Did the user not supply a preferred file path?
    if ( gTraceFilePath[0] == 0 )
    {
        
        strftime ( timestring, 30, "./sdxclogger-%y%d%m%H%M%S.bin", localtime ( &currentTime ) );
        
        if ( strlcpy ( gTraceFilePath, timestring, sizeof ( gTraceFilePath ) ) >= sizeof ( gTraceFilePath ) )
        {
            Quit ( "The path length of raw file is too long\n" );
        }
        
    }
    
    gTraceFileStream = fopen ( gTraceFilePath, "w+" );
    
}


//-----------------------------------------------------------------------------
//	ParseTraceFile
//-----------------------------------------------------------------------------

static void
ParseTraceFile ( )
{
    
    FILE * traceFile;
    
    traceFile = fopen ( gTraceFilePath, "r" );
    kd_buf kp;
	bzero( &kp, sizeof ( kd_buf ) );
	
	if ( traceFile )
	{
        
		while ( fread ( &kp, sizeof ( kd_buf ), 1, traceFile ) )
		{
            
			kd_buf tracepoint;
			bzero ( &tracepoint, sizeof ( kd_buf ) );
			
			if ( kp.debugid == kInvalid )
			{
                
				printf ( "Found an invalid entry in raw file.\n" );
				continue;
                
			}
			
			if ( kp.debugid == kDivisorEntry )
			{
                
				gDivisor = ( double )( kp.timestamp );
				printf ( "Found divisor %f as 0x%llx\n", gDivisor, kp.timestamp );
                
			}
			else
			{
				
				// send tracepoint to be processed
				ParseKernelTracePoint ( kp );
                
			}
            
		}
		
		fclose ( traceFile );
        
	}
    
	else
    {
        Quit ( "Could not open specified trace file :(\n" );
    }
    
}


//-----------------------------------------------------------------------------
//	StringFromReturnCode
//-----------------------------------------------------------------------------

static void
ParseKernelTracePoint ( kd_buf inTracePoint )
{
    
    
    int 				debugID;
    int 				type;
    uint64_t 			now;
    const char *		errorString;
    
    debugID = inTracePoint.debugid;
    type	= debugID & ~( DBG_FUNC_START | DBG_FUNC_END );
    
    now = inTracePoint.timestamp & KDBG_TIMESTAMP_MASK;
    current_usecs = ( int64_t )( now / gDivisor );
    
    
    
    if ( ( type >= 0x05278800 ) && ( type <= 0x05278BFC ) && ( type != kCDBLog2Code ) )
    {
        PrintTimeStamp ( );
    }
    
    switch ( type )
    {
            
#pragma mark -
#pragma mark *** Generic UMC Codes ***
#pragma mark -
			
        case kAbortedTaskCode:
        {
            printf ( "[%10p] Task %p Aborted!!!\n", ( void * ) inTracePoint.arg1, ( void * ) inTracePoint.arg2 );
        }
        break;
			
        case kAbortCurrentSCSITaskCode:
        {
            printf ( "[%10p] Aborted currentTask %p DeviceAttached = %d ConsecutiveResetCount = %d\n",
                    ( void * ) inTracePoint.arg1, ( void * ) inTracePoint.arg2,
                    ( int ) inTracePoint.arg3, ( int ) inTracePoint.arg4 );
        }
        break;
            
        case kCompleteSCSICommandCode:
        {
            
            printf ( "[%10p] Task %p Completed with serviceResponse = %d taskStatus = 0x%x\n",
                    ( void * ) inTracePoint.arg1, ( void * ) inTracePoint.arg2,
                    ( int ) inTracePoint.arg3, ( int ) inTracePoint.arg4 );
            PrintTimeStamp ( );
            printf ( "[%10p] -------------------------------------------------\n", ( void * ) inTracePoint.arg1 );
            
        }
        break;
			
        case kCompletingCommandWithErrorCode:
        {
            printf ( "[%10p] !!!!! Hark !!!!! Completing command with an ERROR status!\n", ( void * ) inTracePoint.arg1 );
        }
        break;
            
        case kLUNConfigurationCompleteCode:
        {
            printf ( "[%10p] MaxLUN = %u\n", ( void * ) inTracePoint.arg1, ( unsigned int ) inTracePoint.arg2 );
        }
        break;
			
        case kNewCommandWhileTerminatingCode:
        {
            printf ( "[%10p] Task = %p received while terminating!!!\n", ( void * ) inTracePoint.arg1, ( void * ) inTracePoint.arg2 );
        }
        break;
			
        case kIOUMCStorageCharacDictFoundCode:
        {
            printf ( "[%10p] This device has a USB Characteristics Dictionary\n", ( void * ) inTracePoint.arg1 );
        }
        break;
			
        case kNoProtocolForDeviceCode:
        {
            printf ( "[%10p] !!! NO USB TRANSPORT PROTOCOL FOR THIS DEVICE !!!\n", ( void * ) inTracePoint.arg1 );
        }
        break;
			
        case kIOUSBMassStorageClassStartCode:
        {
            printf ( "[%10p] Starting up!\n", ( void * ) inTracePoint.arg1 );
        }
        break;
			
        case kIOUSBMassStorageClassStopCode:
        {
            printf ( "[%10p] Stopping!\n", ( void * ) inTracePoint.arg1 );
        }
        break;
			
        case kAtUSBAddressCode:
        {
            printf ( "[%10p] @ USB Address: %u\n", ( void * ) inTracePoint.arg1, ( unsigned int ) inTracePoint.arg2 );
        }
        break;
			
        case kMessagedCalledCode:
        {
            printf ( "[%10p] Message : %x received\n", ( void * ) inTracePoint.arg1, ( unsigned int ) inTracePoint.arg2 );
            PrintTimeStamp ( );
            printf ( "[%10p] -------------------------------------------------\n", ( void * ) inTracePoint.arg1 );
        }
        break;
			
        case kWillTerminateCalledCode:
        {
            printf ( "[%10p] willTerminate called, CurrentInterface=%p, isInactive=%u\n",
					( void * ) inTracePoint.arg1, ( void * ) inTracePoint.arg2, ( unsigned int ) inTracePoint.arg3 );
        }
        break;
			
        case kDidTerminateCalledCode:
        {
            printf ( "[%10p] didTerminate called, fTerminationDeferred=%u\n",
                    ( void * ) inTracePoint.arg1, ( unsigned int ) inTracePoint.arg2 );
        }
        break;
			
        case kCDBLog1Code:
        {
            
            UInt8 *			cdbData;
            unsigned int	i;
            
            printf ( "[%10p] Request %p\n", ( void * ) inTracePoint.arg1, ( void * ) inTracePoint.arg2 );
            PrintTimeStamp ( );
            printf ( "[%10p] ", ( void * ) inTracePoint.arg1 );
            
            cdbData = ( UInt8 * ) &inTracePoint.arg3;
            
            for ( i = 0; i < 4; i++ )
            {
                fullCDB [i] = cdbData[i];
                printf ( "0x%02X : ", cdbData[i] );
            }
            
            cdbData = ( UInt8 * ) &inTracePoint.arg4;
            
            for ( i = 0; i < 4; i++ )
            {
                fullCDB [i+4] = cdbData[i];
                printf ( "0x%02X : ", cdbData[i] );
            }
            
