apple-open-source/macos/IOUSBMassStorageClass/UMCLogger/UMCLogger.cpp
        }
        break;
			
        case kCDBLog2Code:
        {
            
            UInt8 *			cdbData;
            unsigned int 	i;
            
            cdbData = ( UInt8 * ) &inTracePoint.arg3;
            
            for ( i = 0; i < 4; i++ )
            {
                fullCDB [i+8] = cdbData[i];
                printf ( "0x%02X : ", cdbData[i] );
            }
            
            cdbData = ( UInt8 * ) &inTracePoint.arg4;
            
            for ( i = 0; i < 3; i++ )
            {
                fullCDB [i+12] = cdbData[i];
                printf ( "0x%02X : ", cdbData[i] );
            }
            
            fullCDB [i+12] = cdbData[i];
            printf ( "0x%02X\n", cdbData[i] );
            
            PrintTimeStamp ( );
            printf ( "[%10p] ", ( void * ) inTracePoint.arg1 );
            PrintSCSICommand ( );
            
        }
        break;
			
        case kClearEndPointStallCode:
        {
            
            errorString = StringFromReturnCode ( inTracePoint.arg2 );
            printf ( "[%10p] ClearFeatureEndpointStall status=%s (0x%x), endpoint=%u\n",
                    ( void * ) inTracePoint.arg1, errorString, ( unsigned int ) inTracePoint.arg2, ( unsigned int ) inTracePoint.arg3 );
            
        }
        break;
			
        case kGetEndPointStatusCode:
        {
            
            errorString = StringFromReturnCode ( inTracePoint.arg2 );
            printf ( "[%10p] GetEndpointStatus status=%s (0x%x), endpoint=%u\n",
                    ( void * ) inTracePoint.arg1, errorString, ( unsigned int ) inTracePoint.arg2, ( unsigned int ) inTracePoint.arg3 );
            
        }
        break;
			
        case kHandlePowerOnUSBResetCode:
        {
            
            printf ( "[%10p] USB Device Reset on WAKE from SLEEP\n", ( void * ) inTracePoint.arg1 );
            
        }
        break;
			
        case kUSBDeviceResetWhileTerminatingCode:
        {
            
            printf ( "[%10p] Termination started before device reset could be initiated! fTerminating=%u, isInactive=%u\n",
                    ( void * ) inTracePoint.arg1, ( unsigned int ) inTracePoint.arg2, ( unsigned int ) inTracePoint.arg3 );
            
        }
        break;
			
        case kUSBDeviceResetAfterDisconnectCode:
        {
            
            printf ( "[%10p] Device reset was attempted after the device had been disconnected\n", ( void * ) inTracePoint.arg1 );
            
        }
        break;
			
        case kUSBDeviceResetReturnedCode:
        {
            
            printf ( "[%10p] DeviceReset returned: 0x%08x\n", ( void * ) inTracePoint.arg1, ( unsigned int ) inTracePoint.arg2 );
            
        }
        break;
            
        case kDeviceInformationCode:
        {
            errorString = StringFromReturnCode ( inTracePoint.arg2 );
            printf ( "[%10p] Device Information status=%s DeviceInformation=0x%x\n", ( void * ) inTracePoint.arg1,
                    errorString, ( int ) inTracePoint.arg3 );
        }
        break;
            
        case kSuspendPortCode:
        {
            
            errorString = StringFromReturnCode ( inTracePoint.arg2 );
            if ( inTracePoint.arg3 == 0 )
            {
                printf ( "[%10p] Suspend Port (RESUME) returned status=%s\n", ( void * ) inTracePoint.arg1, errorString );
            }
            
            else
            {
                printf ( "[%10p] Suspend Port (SUSPEND) returned status=%s\n", ( void * ) inTracePoint.arg1,  errorString );
            }
            
        }
        break;
            
        case kSubclassUseCode:
        {
            
            // This is special code that we let our subclasses use. We have a helper function to handle these.
            ProcessSubclassTracePoint ( inTracePoint );
            
        }
        break;
			
#pragma mark -
#pragma mark *** Control Bulk Interrupt ( CBI ) Codess ***
#pragma mark -
			
        case kCBIProtocolDeviceDetectedCode:
        {
            
            printf ( "[%10p] CBI transport protocol device\n", ( void * ) inTracePoint.arg1 );
            
        }
        break;
			
        case kCBICommandAlreadyInProgressCode:
        {
			
            if ( gHideBusyRejectedCommands == FALSE )
            {
                
                printf ( "[%10p] CBI - Unable to accept task %p, still working on previous command\n",
                        ( void * ) inTracePoint.arg1, ( void * ) inTracePoint.arg2 );
                
            }
            
        }
        break;
			
        case kCBISendSCSICommandReturnedCode:
        {
            
            errorString = StringFromReturnCode ( inTracePoint.arg3 );
            printf ( "[%10p] CBI - SCSI Task %p was sent with status %s (0x%x)\n",
                    ( void * ) inTracePoint.arg1, ( void * ) inTracePoint.arg2, errorString, ( unsigned int ) inTracePoint.arg3 );
            
        }
        break;
			
#pragma mark -
#pragma mark *** Bulk-Only Protocol Codes ***
#pragma mark -
			
        case kBODeviceDetectedCode:
        {
            
            printf ( "[%10p] BULK-ONLY transport protocol device\n", ( void * ) inTracePoint.arg1 );
            
        }
        break;
			
        case kBOCommandAlreadyInProgressCode:
        {
            
            if ( gHideBusyRejectedCommands == FALSE )
            {
                
                printf ( "[%10p] B0 - Unable to accept task %p, still working on previous request\n",
                        ( void * ) inTracePoint.arg1, ( void * ) inTracePoint.arg2 );
                
            }
            
        }
        break;
			
        case kBOSendSCSICommandReturnedCode:
        {
            
            errorString = StringFromReturnCode ( inTracePoint.arg3 );
            printf ( "[%10p] BO - SCSI Task %p was sent with status %s (0x%x)\n",
                    ( void * ) inTracePoint.arg1, ( void * ) inTracePoint.arg2, errorString, ( unsigned int ) inTracePoint.arg3 );
            
