apple-open-source/macos/IOUSBMassStorageClass/UMCLogger/UMCLogger.cpp
        }
        break;

        case kAppleUSBCardReaderUMC_controllerReset:
        {
            printf ( "[%10p] AUCRU - SDControllerReset returned=0x%x\n", ( void * ) inTracePoint.arg2, ( int ) inTracePoint.arg3 );
        }
        break;
            
        case kAppleUSBCardReaderUMC_powerControl:
        {
            
            if ( inTracePoint.arg4 != 0 )
            {
                printf ( "[%10p] AUCRU - SDControllerPower powering ON returned=0x%x\n", ( void * ) inTracePoint.arg2, ( int ) inTracePoint.arg3 );
            }
            
            else
            {
                printf ( "[%10p] AUCRU - SDControllerPower powering OFF returned=0x%x\n", ( void * ) inTracePoint.arg2, ( int ) inTracePoint.arg3 );
            }
            
        }
        break;
            
        case kAppleUSBCardReaderUMC_waitForReconnect:
        {
            
            if ( inTracePoint.arg4 != 0 )
            {
                printf ( "[%10p] AUCRU - GatedWaitForReconnect exiting returned=0x%x\n", ( void * ) inTracePoint.arg2, ( int ) inTracePoint.arg3 );
            }
            
            else
            {
                printf ( "[%10p] AUCRU - GatedWaitForReconnect entered returned=0x%x\n", ( void * ) inTracePoint.arg2, ( int ) inTracePoint.arg3 );
            }
            
        }
        break;
            
        case kAppleUSBCardReaderUMC_systemWillShutdown:
        {
            printf ( "[%10p] AUCRU - systemWillShutdown specifier=0x%x\n", ( void * ) inTracePoint.arg2, ( int ) inTracePoint.arg3 );
        }
        break;
            
        case kAppleUSBCardReaderUMC_generalPurpose:
        {
            printf ( "[%10p] AUCRU - General Purpose 0x%x 0x%x\n", ( void * ) inTracePoint.arg2,
                     ( int ) inTracePoint.arg3, ( int ) inTracePoint.arg4 );
        }
        break;
            
        default:
        {
            printf ( "Recieved request for intSubclassCode=0x%lx for AppleUSBCardReaderUMC, but know of no such intSubclassCode\n", ( unsigned long ) inSubclassCode );
        }
            
    }
    
}


//-----------------------------------------------------------------------------
//	EOF
//-----------------------------------------------------------------------------
